{"format": "layers-model", "generatedBy": "keras v2.13.1", "convertedBy": "TensorFlow.js Converter v4.11.0", "modelTopology": {"keras_version": "2.13.1", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_71", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_76"}, "name": "input_76", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_1143", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1143", "inbound_nodes": [[["input_76", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1144", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1144", "inbound_nodes": [[["conv2d_1143", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_265", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_265", "inbound_nodes": [[["conv2d_1144", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_519", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_519", "inbound_nodes": [[["max_pooling2d_265", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1145", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1145", "inbound_nodes": [[["dropout_519", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1146", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1146", "inbound_nodes": [[["conv2d_1145", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_266", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_266", "inbound_nodes": [[["conv2d_1146", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_520", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_520", "inbound_nodes": [[["max_pooling2d_266", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1147", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1147", "inbound_nodes": [[["dropout_520", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1148", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1148", "inbound_nodes": [[["conv2d_1147", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_257", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_257", "inbound_nodes": [[["conv2d_1148", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_257", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_257", "inbound_nodes": [[["conv2d_transpose_257", 0, 0, {}], ["conv2d_1146", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_521", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_521", "inbound_nodes": [[["concatenate_257", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1149", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1149", "inbound_nodes": [[["dropout_521", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1150", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1150", "inbound_nodes": [[["conv2d_1149", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_258", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_258", "inbound_nodes": [[["conv2d_1150", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_258", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_258", "inbound_nodes": [[["conv2d_transpose_258", 0, 0, {}], ["conv2d_1144", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_522", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_522", "inbound_nodes": [[["concatenate_258", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1151", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1151", "inbound_nodes": [[["dropout_522", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1152", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1152", "inbound_nodes": [[["conv2d_1151", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1153", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1153", "inbound_nodes": [[["conv2d_1152", 0, 0, {}]]]}], "input_layers": [["input_76", 0, 0]], "output_layers": [["conv2d_1153", 0, 0]]}}, "training_config": {"loss": "CategoricalCrossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 9.999999747378752e-05, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_1143/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_1143/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1144/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1144/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1145/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_1145/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1146/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_1146/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1147/kernel", "shape": [3, 3, 64, 96], "dtype": "float32"}, {"name": "conv2d_1147/bias", "shape": [96], "dtype": "float32"}, {"name": "conv2d_1148/kernel", "shape": [3, 3, 96, 96], "dtype": "float32"}, {"name": "conv2d_1148/bias", "shape": [96], "dtype": "float32"}, {"name": "conv2d_1149/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_1149/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1150/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_1150/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1151/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "conv2d_1151/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1152/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_1152/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1153/kernel", "shape": [1, 1, 32, 4], "dtype": "float32"}, {"name": "conv2d_1153/bias", "shape": [4], "dtype": "float32"}, {"name": "conv2d_transpose_257/kernel", "shape": [3, 3, 64, 96], "dtype": "float32"}, {"name": "conv2d_transpose_257/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_258/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_transpose_258/bias", "shape": [32], "dtype": "float32"}]}]}