{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.10.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "LC_Model", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_32"}, "name": "input_32", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_651", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_651", "inbound_nodes": [[["input_32", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_652", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_652", "inbound_nodes": [[["conv2d_651", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_155", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_155", "inbound_nodes": [[["conv2d_652", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_310", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_310", "inbound_nodes": [[["max_pooling2d_155", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_653", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_653", "inbound_nodes": [[["dropout_310", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_654", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_654", "inbound_nodes": [[["conv2d_653", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_156", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_156", "inbound_nodes": [[["conv2d_654", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_311", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_311", "inbound_nodes": [[["max_pooling2d_156", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_655", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_655", "inbound_nodes": [[["dropout_311", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_656", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_656", "inbound_nodes": [[["conv2d_655", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_157", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_157", "inbound_nodes": [[["conv2d_656", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_312", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_312", "inbound_nodes": [[["max_pooling2d_157", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_657", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_657", "inbound_nodes": [[["dropout_312", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_658", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_658", "inbound_nodes": [[["conv2d_657", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_158", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_158", "inbound_nodes": [[["conv2d_658", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_313", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_313", "inbound_nodes": [[["max_pooling2d_158", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_659", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_659", "inbound_nodes": [[["dropout_313", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_660", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_660", "inbound_nodes": [[["conv2d_659", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_159", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_159", "inbound_nodes": [[["conv2d_660", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_314", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_314", "inbound_nodes": [[["max_pooling2d_159", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_155", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_155", "inbound_nodes": [[["dropout_314", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_155", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_155", "inbound_nodes": [[["conv2d_transpose_155", 0, 0, {}], ["conv2d_660", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_661", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_661", "inbound_nodes": [[["concatenate_155", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_662", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_662", "inbound_nodes": [[["conv2d_661", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_315", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_315", "inbound_nodes": [[["conv2d_662", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_156", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_156", "inbound_nodes": [[["dropout_315", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_156", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_156", "inbound_nodes": [[["conv2d_transpose_156", 0, 0, {}], ["conv2d_658", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_663", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_663", "inbound_nodes": [[["concatenate_156", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_664", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_664", "inbound_nodes": [[["conv2d_663", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_316", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_316", "inbound_nodes": [[["conv2d_664", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_157", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_157", "inbound_nodes": [[["dropout_316", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_157", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_157", "inbound_nodes": [[["conv2d_transpose_157", 0, 0, {}], ["conv2d_656", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_665", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_665", "inbound_nodes": [[["concatenate_157", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_666", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_666", "inbound_nodes": [[["conv2d_665", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_317", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_317", "inbound_nodes": [[["conv2d_666", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_158", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_158", "inbound_nodes": [[["dropout_317", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_158", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_158", "inbound_nodes": [[["conv2d_transpose_158", 0, 0, {}], ["conv2d_654", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_667", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_667", "inbound_nodes": [[["concatenate_158", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_668", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_668", "inbound_nodes": [[["conv2d_667", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_318", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_318", "inbound_nodes": [[["conv2d_668", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_159", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_159", "inbound_nodes": [[["dropout_318", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_159", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_159", "inbound_nodes": [[["conv2d_transpose_159", 0, 0, {}], ["conv2d_652", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_669", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_669", "inbound_nodes": [[["concatenate_159", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_670", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_670", "inbound_nodes": [[["conv2d_669", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_319", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_319", "inbound_nodes": [[["conv2d_670", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_671", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_671", "inbound_nodes": [[["dropout_319", 0, 0, {}]]]}], "input_layers": [["input_32", 0, 0]], "output_layers": [["conv2d_671", 0, 0]]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-05, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of18.bin", "group1-shard2of18.bin", "group1-shard3of18.bin", "group1-shard4of18.bin", "group1-shard5of18.bin", "group1-shard6of18.bin", "group1-shard7of18.bin", "group1-shard8of18.bin", "group1-shard9of18.bin", "group1-shard10of18.bin", "group1-shard11of18.bin", "group1-shard12of18.bin", "group1-shard13of18.bin", "group1-shard14of18.bin", "group1-shard15of18.bin", "group1-shard16of18.bin", "group1-shard17of18.bin", "group1-shard18of18.bin"], "weights": [{"name": "conv2d_651/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_651/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_652/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_652/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_653/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_653/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_654/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_654/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_655/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_655/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_656/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_656/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_657/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_657/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_658/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_658/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_659/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv2d_659/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_660/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_660/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_661/kernel", "shape": [3, 3, 1024, 512], "dtype": "float32"}, {"name": "conv2d_661/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_662/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_662/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_663/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "conv2d_663/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_664/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_664/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_665/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_665/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_666/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_666/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_667/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_667/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_668/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_668/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_669/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "conv2d_669/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_670/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_670/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_671/kernel", "shape": [1, 1, 32, 4], "dtype": "float32"}, {"name": "conv2d_671/bias", "shape": [4], "dtype": "float32"}, {"name": "conv2d_transpose_155/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_transpose_155/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_156/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv2d_transpose_156/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_157/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_transpose_157/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_158/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_transpose_158/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_159/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_transpose_159/bias", "shape": [32], "dtype": "float32"}]}]}