{"format": "layers-model", "generatedBy": "keras v2.13.1", "convertedBy": "TensorFlow.js Converter v4.11.0", "modelTopology": {"keras_version": "2.13.1", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_27", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_29"}, "name": "input_29", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_411", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_411", "inbound_nodes": [[["input_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_412", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_412", "inbound_nodes": [[["conv2d_411", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_83", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_83", "inbound_nodes": [[["conv2d_412", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_164", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_164", "inbound_nodes": [[["max_pooling2d_83", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_413", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_413", "inbound_nodes": [[["dropout_164", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_414", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_414", "inbound_nodes": [[["conv2d_413", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_84", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_84", "inbound_nodes": [[["conv2d_414", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_165", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_165", "inbound_nodes": [[["max_pooling2d_84", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_415", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_415", "inbound_nodes": [[["dropout_165", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_416", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_416", "inbound_nodes": [[["conv2d_415", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_85", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_85", "inbound_nodes": [[["conv2d_416", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_166", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_166", "inbound_nodes": [[["max_pooling2d_85", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_417", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_417", "inbound_nodes": [[["dropout_166", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_418", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_418", "inbound_nodes": [[["conv2d_417", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_82", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_82", "inbound_nodes": [[["conv2d_418", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_82", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_82", "inbound_nodes": [[["conv2d_transpose_82", 0, 0, {}], ["conv2d_416", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_167", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_167", "inbound_nodes": [[["concatenate_82", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_419", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_419", "inbound_nodes": [[["dropout_167", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_420", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_420", "inbound_nodes": [[["conv2d_419", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_83", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_83", "inbound_nodes": [[["conv2d_420", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_83", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_83", "inbound_nodes": [[["conv2d_transpose_83", 0, 0, {}], ["conv2d_414", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_168", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_168", "inbound_nodes": [[["concatenate_83", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_421", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_421", "inbound_nodes": [[["dropout_168", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_422", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_422", "inbound_nodes": [[["conv2d_421", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_84", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "conv2d_transpose_84", "inbound_nodes": [[["conv2d_422", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_84", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_84", "inbound_nodes": [[["conv2d_transpose_84", 0, 0, {}], ["conv2d_412", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_169", "trainable": true, "dtype": "float32", "rate": 0.4, "noise_shape": null, "seed": null}, "name": "dropout_169", "inbound_nodes": [[["concatenate_84", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_423", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_423", "inbound_nodes": [[["dropout_169", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_424", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_424", "inbound_nodes": [[["conv2d_423", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_425", "trainable": true, "dtype": "float32", "filters": 4, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_425", "inbound_nodes": [[["conv2d_424", 0, 0, {}]]]}], "input_layers": [["input_29", 0, 0]], "output_layers": [["conv2d_425", 0, 0]]}}, "training_config": {"loss": "CategoricalCrossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 9.999999747378752e-05, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "conv2d_411/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_411/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_412/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_412/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_413/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_413/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_414/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_414/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_415/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_415/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_416/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_416/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_417/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_417/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_418/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_418/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_419/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_419/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_420/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_420/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_421/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_421/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_422/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_422/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_423/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "conv2d_423/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_424/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_424/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_425/kernel", "shape": [1, 1, 32, 4], "dtype": "float32"}, {"name": "conv2d_425/bias", "shape": [4], "dtype": "float32"}, {"name": "conv2d_transpose_82/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_transpose_82/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_83/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_transpose_83/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_84/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_transpose_84/bias", "shape": [32], "dtype": "float32"}]}]}